package com.fudan._01introducation;
/*
假设一个班上有80人，现在需要统计某一门课程的平均成绩，是否需要定义80个变量?

数组是存储多个，具有相同数据类型的数据元素的有序容器（集合）

数组的定义
   1、数组能存储多个元素，多个数据
   2、这些数据元素的数据类型，必须一致
   3.这是数据是有序地：
      1.数组中的每个存储单元，都有唯一编号（下标）该编号，从左向右，从0开始编号，最大值是（数组长度-1）

除此之外
   1.定义一个数组，也是定义一个变量。而且是一种引用1数据类型变量，数组是典型的引用数据类型!
   2.数组里面，可以存储基本数据类型，也可以存储应用数据类型，但是一个数组里面只能存储相同数据类型的元素。
*/
public class Demo {
   public static void main(String[] args) {
      int score1 =99;
      int score2 =98;
      int score3 =97;
      int score4 =95;
      //............
      //计算平均成绩

   }

}
